In [5]:
import mod1

In [5]:
a = mod1.to_excel()

In [3]:
a.get_program_trend_date(type=2)

363

            차익  비차익  전체
19-08-23  -149  215  66

In [4]:
a.get_investor_trend_date(type=2)

363

            개인 외국인   기관
19-08-23  -912  75  664

In [5]:
a.get_kpi200_date(type=2)

563

            KPI200    거래량
2019-08-23  256.11  54778

In [6]:
a.get_money_trend_date(type=2)

           고객예탁금   신용잔고   주식형펀드   혼합형펀드    채권형펀드
19-08-21  241387  82603  788020  264822  1229515

In [6]:
b = mod1.to_sql()

In [8]:
b.excel_to_sql(type=2)

파일이름을 입력하세요:kpi200.xlsx
            Date  kpi200     거래량
0     2006-01-03  178.81  158041
1     2006-01-04  179.91  188841
2     2006-01-05  178.82  206332
3     2006-01-06  180.87  206313
4     2006-01-09  180.30  191222
5     2006-01-10  178.98  182811
6     2006-01-11  178.67  210165
7     2006-01-12  179.65  174516
8     2006-01-13  181.71  164021
9     2006-01-16  182.39  161264
10    2006-01-17  178.27  179089
11    2006-01-18  173.81  214270
12    2006-01-19  174.93  158267
13    2006-01-20  170.60  196215
14    2006-01-23  168.04  194868
15    2006-01-24  171.79  202230
16    2006-01-25  173.52  193873
17    2006-01-26  174.71  146079
18    2006-01-27  178.64  151204
19    2006-01-31  180.65  133175
20    2006-02-01  178.07  156566
21    2006-02-02  177.92  148308
22    2006-02-03  172.67  153799
23    2006-02-06  173.66  143668
24    2006-02-07  172.39  123073
25    2006-02-08  169.44  140059
26    2006-02-09  170.93  124130
27    2006-02-10  172.68  126671
28    2006-02-13  170.61  114299
29    2006-02-14  171.65  102969
...          ...     ...     ...
3343  2019-07-12  272.68   54810
3344  2019-07-15  272.64   82080
3345  2019-07-16  274.05  134388
3346  2019-07-17  271.48  115622
3347  2019-07-18  270.67   78649
3348  2019-07-19  274.55   85702
3349  2019-07-22  274.55   59881
3350  2019-07-23  275.92   93952
3351  2019-07-24  273.22   82752
3352  2019-07-25  273.04   94460
3353  2019-07-26  272.25   88517
3354  2019-07-29  267.75   78754
3355  2019-07-30  268.95   64529
3356  2019-07-31  266.34   96236
3357  2019-08-01  265.73   72578
3358  2019-08-02  262.99   99663
3359  2019-08-05  257.19  131042
3360  2019-08-06  253.41  123167
3361  2019-08-07  252.00   90744
3362  2019-08-08  252.40  163707
3363  2019-08-09  254.85  117692
3364  2019-08-12  255.35   69377
3365  2019-08-13  252.83   76819
3366  2019-08-14  254.86   82238
3367  2019-08-16  253.90   71830
3368  2019-08-19  255.11   66018
3369  2019-08-20  258.05   81693
3370  2019-08-21  258.38   65481
3371  2019-08-22  256.28   67254
3372  2019-08-23  256.11   54778

[3373 rows x 3 columns]